In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s = pd.Series([1,3,5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
dates = pd.date_range("20130101", periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))

In [10]:
df

                   A         B         C         D
2013-01-01 -2.063703  0.218018 -1.254445  0.986173
2013-01-02  0.099849 -0.238729  1.505499  1.694493
2013-01-03  1.983725 -0.518684 -0.754444  2.090429
2013-01-04 -0.846613  0.868101  0.900229 -1.941127
2013-01-05 -1.510353  0.353125 -0.315736 -0.312146
2013-01-06  0.814183 -0.759603  0.579726  0.387508

In [11]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df.head()

                   A         B         C         D
2013-01-01 -2.063703  0.218018 -1.254445  0.986173
2013-01-02  0.099849 -0.238729  1.505499  1.694493
2013-01-03  1.983725 -0.518684 -0.754444  2.090429
2013-01-04 -0.846613  0.868101  0.900229 -1.941127
2013-01-05 -1.510353  0.353125 -0.315736 -0.312146

In [16]:
df.tail()

                   A         B         C         D
2013-01-02  0.099849 -0.238729  1.505499  1.694493
2013-01-03  1.983725 -0.518684 -0.754444  2.090429
2013-01-04 -0.846613  0.868101  0.900229 -1.941127
2013-01-05 -1.510353  0.353125 -0.315736 -0.312146
2013-01-06  0.814183 -0.759603  0.579726  0.387508

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.to_numpy()

array([[-2.06370298,  0.2180182 , -1.25444481,  0.98617251],
       [ 0.09984873, -0.23872911,  1.50549882,  1.694493  ],
       [ 1.98372506, -0.51868357, -0.75444448,  2.09042887],
       [-0.84661321,  0.86810088,  0.90022871, -1.94112723],
       [-1.51035276,  0.35312524, -0.31573607, -0.31214609],
       [ 0.81418288, -0.75960349,  0.57972601,  0.3875085 ]])

In [21]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [22]:
df2.index

Index([0, 1, 2, 3], dtype='int64')

In [23]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.253819 -0.012962  0.110138  0.484222
std    1.515142  0.604623  1.056669  1.471223
min   -2.063703 -0.759603 -1.254445 -1.941127
25%   -1.344418 -0.448695 -0.644767 -0.137232
50%   -0.373382 -0.010355  0.131995  0.686841
75%    0.635599  0.319348  0.820103  1.517413
max    1.983725  0.868101  1.505499  2.090429

In [24]:
df["A"]

2013-01-01   -2.063703
2013-01-02    0.099849
2013-01-03    1.983725
2013-01-04   -0.846613
2013-01-05   -1.510353
2013-01-06    0.814183
Freq: D, Name: A, dtype: float64

In [25]:
df.A

2013-01-01   -2.063703
2013-01-02    0.099849
2013-01-03    1.983725
2013-01-04   -0.846613
2013-01-05   -1.510353
2013-01-06    0.814183
Freq: D, Name: A, dtype: float64

In [30]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.099849 -0.238729  1.505499  1.694493
2013-01-03  1.983725 -0.518684 -0.754444  2.090429
2013-01-04 -0.846613  0.868101  0.900229 -1.941127

In [32]:
df.loc["20130102":"20130104", ["B", "C"]]

                   B         C
2013-01-02 -0.238729  1.505499
2013-01-03 -0.518684 -0.754444
2013-01-04  0.868101  0.900229

In [33]:
df.iloc[0]

A   -2.063703
B    0.218018
C   -1.254445
D    0.986173
Name: 2013-01-01 00:00:00, dtype: float64